# Veri Bilimine Giriş

In [1]:
import pandas as pd

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\administrator\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\administrator\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 23.0.1 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
df_empty = pd.DataFrame() #boş bir dataframe oluştururuz. Excell formatında bir dataframe oluşturulur gibi düşünülebilir. 
df_empty

Empty DataFrame
Columns: []
Index: []

In [4]:
df = pd.DataFrame({'name':['Bob','Jen','Tim'],
                  'age':[20,30,40],
                  'pet':['cat', 'dog', 'bird']})
df

  name  age   pet
0  Bob   20   cat
1  Jen   30   dog
2  Tim   40  bird

In [5]:
df[['name','age']] #oluşturulan df den name ve age sutunlarını gormek istersek

  name  age
0  Bob   20
1  Jen   30
2  Tim   40

In [6]:
df.name #Tek b ir sutun istiyorsak nokta şeklinde yazarız

0    Bob
1    Jen
2    Tim
Name: name, dtype: object

## indexing

In [7]:
# 'First name'
# df.ix[0]

In [8]:
df.sort_values('pet', inplace=True) #pet sutununu alfabetik sıralar inplace true olursa indexini var olan indexi ile döndürür.
df

  name  age   pet
2  Tim   40  bird
0  Bob   20   cat
1  Jen   30   dog

In [9]:
df.iloc[0] #ilk index i getirir.

name     Tim
age       40
pet     bird
Name: 2, dtype: object

In [10]:
df.iloc[:,2] #

2    bird
0     cat
1     dog
Name: pet, dtype: object

In [11]:
df.iloc[-1:] #en sondakini getirir

  name  age  pet
1  Jen   30  dog

## CSV

In [12]:
#csv dosyası okuma
data = pd.read_csv('test_pandas.csv')
data

   0  1   cat  1.1
0  1  2   dog  2.2
1  2  3  bird  3.3

In [13]:
#
data.to_csv('test_pandas_no_header.csv', header=False, index=True)
data

   0  1   cat  1.1
0  1  2   dog  2.2
1  2  3  bird  3.3

In [14]:
dat_no_header = pd.read_csv('test_pandas_no_header.csv')
dat_no_header

   0  1  2   dog  2.2
0  1  2  3  bird  3.3

## Excell

In [15]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\administrator\anaconda3\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\administrator\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip is available: 23.0.1 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [16]:
data = pd.read_excel('test_pandas.xlsm','Sheet1')
data

C:\Users\Administrator\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

   Column A Column B  Column C
0         1      cat       1.1
1         2      dog       2.2
2         3     bird       3.3

In [17]:
#
writer = pd.ExcelWriter('test_sheets.xlsm')
data.to_excel(writer,'Original')
data.to_excel(writer,'Copy')
writer.save()
pd.read_excel('test_sheets.xlsx', 'Original')

   Unnamed: 0  0  1     2    3
0           0  0  1   cat  1.1
1           1  1  2   dog  2.2
2           2  2  3  bird  3.3

## SQL

In [28]:
import sqlite3
conn=sqlite3.connect('test_pandas.db')

In [29]:
sql_query="SELECT * FROM test"
data=pd.read_sql(sql_query, conn)
data

    id           city    mascot
0    1  San Francisco     49ers
1    2        Oakland   Raiders
2    3        Seattle  Seahawks
3    4        Chicago     Bears
4    5            NYC      Jets
5    6             LA      Rams
6    7            ANA  Chargers
7    6             LA      Rams
8    7            ANA  Chargers
9    6             LA      Rams
10   7            ANA  Chargers
11   6             LA      Rams
12   7            ANA  Chargers

In [30]:
print(pd.__version__)

1.4.2

In [32]:
data.sort_values(by='city')

    id           city    mascot
6    7            ANA  Chargers
8    7            ANA  Chargers
10   7            ANA  Chargers
12   7            ANA  Chargers
3    4        Chicago     Bears
5    6             LA      Rams
7    6             LA      Rams
9    6             LA      Rams
11   6             LA      Rams
4    5            NYC      Jets
1    2        Oakland   Raiders
0    1  San Francisco     49ers
2    3        Seattle  Seahawks

In [33]:
tables=conn.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [34]:
new_data=pd.DataFrame({
    'id':[6,7],
    'city':['LA','ANA'],
    'mascot':['Rams','Chargers']
})
new_data

   id city    mascot
0   6   LA      Rams
1   7  ANA  Chargers

In [35]:
new_data.to_sql('test',conn,if_exists='append',index=False)

2

In [36]:
conn.close()